---
kind: property
id: P:Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.MaterialTexture
source: html/1c1b2022-356f-0ad6-6238-dcbe3727c505.htm
---
# Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.MaterialTexture Property

An external resource type representing material texture images.

## Syntax (C#)
```csharp
public static ExternalResourceType MaterialTexture { get; }
```